---
kind: method
id: M:Autodesk.Revit.DB.Element.HasPhases
zh: 构件、图元、元素
source: html/5d850f8a-4a50-406b-6c59-b85d49dcbb2e.htm
---
# Autodesk.Revit.DB.Element.HasPhases Method

**中文**: 构件、图元、元素

Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.

## Syntax (C#)
```csharp
public bool HasPhases()
```

## Returns
True if this Element has the properties CreatedPhaseId and DemolishedPhaseId, false otherwise.

## Remarks
Acts as a validator for setting the properties CreatedPhaseId and DemolishedPhaseId.